zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/MIMXRT798S_hifi4_COMMON.h
/*
** ###################################################################
**     Processors:          MIMXRT798SGAWBR_hifi4
**                          MIMXRT798SGFOB_hifi4
**                          MIMXRT798SGVKB_hifi4
**
**     Compiler:            Xtensa Compiler
**     Reference manual:    iMXRT700RM Rev.5, 10/2025
**     Version:             rev. 6.0, 2025-12-29
**     Build:               b260429
**
**     Abstract:
**         Peripheral Access Layer for MIMXRT798S_hifi4
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**     - rev. 3.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**     - rev. 4.0 (2025-06-06)
**         B0 initial version
**     - rev. 5.0 (2025-11-13)
**         Add puf/sdadc irq and cache64 compatibility macros to common header.
**     - rev. 5.1 (2025-12-08)
**         Update RM version and add pdm irq for hifi1/hifi4.
**     - rev. 6.0 (2025-12-29)
**         Add new part number.
**
** ###################################################################
*/

/*!
 * @file MIMXRT798S_hifi4_COMMON.h
 * @version 6.0
 * @date 2025-12-29
 * @brief Peripheral Access Layer for MIMXRT798S_hifi4
 *
 * Peripheral Access Layer for MIMXRT798S_hifi4
 */

#if !defined(MIMXRT798S_HIFI4_COMMON_H_)
#define MIMXRT798S_HIFI4_COMMON_H_               /**< Symbol preventing repeated inclusion */

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0600U
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0000U

/* ----------------------------------------------------------------------------
   --
   ---------------------------------------------------------------------------- */

/* IO definitions (access restrictions to peripheral registers) */
/**
    \defgroup CMSIS_glob_defs CMSIS Global Defines
    <strong>IO Type Qualifiers</strong> are used
    \li to specify the access to peripheral variables.
    \li for automatic generation of peripheral register debug information.
*/
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

#define __STATIC_INLINE static inline

#define __BKPT(value) do {} while(0)
#define __NOP() do {} while(0)

#include "system_MIMXRT798S_hifi4.h"     /* Device specific configuration file */



/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers Interrupt vector numbers
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 136                /**< Number of interrupts in the Vector table */

typedef enum IRQn {
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Device specific interrupts */
  NonMaskableInt_IRQn          = 0,                /**< Interrupt selected by HIFI4_INTERRUPT0 */
  Software_IRQn                = 1,                /**< Software triggered Interrupt */
  RtosTimer0_IRQn              = 2,                /**< Internal RTOS Timer0 Interrupt */
  RtosTimer1_IRQn              = 3,                /**< Internal RTOS Timer1 Interrupt */
  Profiling_IRQn               = 4,                /**< Profiling Interrupt */
  WriteError_IRQn              = 5,                /**< Write Error */
  DSP_INT0_SEL1_IRQn           = 6,                /**< Interrupt selected by HIFI4_INTERRUPT1 */
  DSP_INT0_SEL2_IRQn           = 7,                /**< Interrupt selected by HIFI4_INTERRUPT2 */
  DSP_INT0_SEL3_IRQn           = 8,                /**< Interrupt selected by HIFI4_INTERRUPT3 */
  DSP_INT0_SEL4_IRQn           = 9,                /**< Interrupt selected by HIFI4_INTERRUPT4 */
  DSP_INT0_SEL5_IRQn           = 10,               /**< Interrupt selected by HIFI4_INTERRUPT5 */
  DSP_INT0_SEL6_IRQn           = 11,               /**< Interrupt selected by HIFI4_INTERRUPT6 */
  DSP_INT0_SEL7_IRQn           = 12,               /**< Interrupt selected by HIFI4_INTERRUPT7 */
  DSP_INT0_SEL8_IRQn           = 13,               /**< Interrupt selected by HIFI4_INTERRUPT8 */
  DSP_INT0_SEL9_IRQn           = 14,               /**< Interrupt selected by HIFI4_INTERRUPT9 */
  DSP_INT0_SEL10_IRQn          = 15,               /**< Interrupt selected by HIFI4_INTERRUPT10 */
  DSP_INT0_SEL11_IRQn          = 16,               /**< Interrupt selected by HIFI4_INTERRUPT11 */
  DSP_INT0_SEL12_IRQn          = 17,               /**< Interrupt selected by HIFI4_INTERRUPT12 */
  DSP_INT0_SEL13_IRQn          = 18,               /**< Interrupt selected by HIFI4_INTERRUPT13 */
  DSP_INT0_SEL14_IRQn          = 19,               /**< Interrupt selected by HIFI4_INTERRUPT14 */
  DSP_INT0_SEL15_IRQn          = 20,               /**< Interrupt selected by HIFI4_INTERRUPT15 */
  DSP_INT0_SEL16_IRQn          = 21,               /**< Interrupt selected by HIFI4_INTERRUPT16 */
  DSP_INT0_SEL17_IRQn          = 22,               /**< Interrupt selected by HIFI4_INTERRUPT17 */
  DSP_INT0_SEL18_IRQn          = 23,               /**< Interrupt selected by HIFI4_INTERRUPT18 */
  DSP_INT0_SEL19_IRQn          = 24,               /**< Interrupt selected by HIFI4_INTERRUPT19 */
  DSP_INT0_SEL20_IRQn          = 25,               /**< Interrupt selected by HIFI4_INTERRUPT20 */
  DSP_INT0_SEL21_IRQn          = 26,               /**< Interrupt selected by HIFI4_INTERRUPT21 */
  DSP_INT0_SEL22_IRQn          = 27,               /**< Interrupt selected by HIFI4_INTERRUPT22 */
  DSP_INT0_SEL23_IRQn          = 28,               /**< Interrupt selected by HIFI4_INTERRUPT23 */
  DSP_INT0_SEL24_IRQn          = 29,               /**< Interrupt selected by HIFI4_INTERRUPT24 */
  DSP_INT0_SEL25_IRQn          = 30,               /**< Interrupt selected by HIFI4_INTERRUPT25 */
  DSP_INT0_SEL26_IRQn          = 31,               /**< Interrupt selected by HIFI4_INTERRUPT26 */
  LP_FLEXCOMM0_IRQn            = 32,               /**< LP_FLEXCOMM0 (HIFI4_INTTERRUPTn source IRQ0) */
  LP_FLEXCOMM1_IRQn            = 33,               /**< LP_FLEXCOMM1 (HIFI4_INTTERRUPTn source IRQ1) */
  LP_FLEXCOMM2_IRQn            = 34,               /**< LP_FLEXCOMM2 (HIFI4_INTTERRUPTn source IRQ2) */
  LP_FLEXCOMM3_IRQn            = 35,               /**< LP_FLEXCOMM3 (HIFI4_INTTERRUPTn source IRQ3) */
  LP_FLEXCOMM4_IRQn            = 36,               /**< LP_FLEXCOMM4 (HIFI4_INTTERRUPTn source IRQ4) */
  LP_FLEXCOMM5_IRQn            = 37,               /**< LP_FLEXCOMM5 (HIFI4_INTTERRUPTn source IRQ5) */
  LP_FLEXCOMM6_IRQn            = 38,               /**< LP_FLEXCOMM6 (HIFI4_INTTERRUPTn source IRQ6) */
  LP_FLEXCOMM7_IRQn            = 39,               /**< LP_FLEXCOMM7 (HIFI4_INTTERRUPTn source IRQ7) */
  LP_FLEXCOMM8_IRQn            = 40,               /**< LP_FLEXCOMM8 (HIFI4_INTTERRUPTn source IRQ8) */
  LP_FLEXCOMM9_IRQn            = 41,               /**< LP_FLEXCOMM9 (HIFI4_INTTERRUPTn source IRQ9) */
  LP_FLEXCOMM10_IRQn           = 42,               /**< LP_FLEXCOMM10 (HIFI4_INTTERRUPTn source IRQ10) */
  LP_FLEXCOMM11_IRQn           = 43,               /**< LP_FLEXCOMM11 (HIFI4_INTTERRUPTn source IRQ11) */
  LP_FLEXCOMM12_IRQn           = 44,               /**< LP_FLEXCOMM12 (HIFI4_INTTERRUPTn source IRQ12) */
  LP_FLEXCOMM13_IRQn           = 45,               /**< LP_FLEXCOMM13 (HIFI4_INTTERRUPTn source IRQ13) */
  MU2_MUA_IRQn                 = 46,               /**< MU2_MUA (HIFI4_INTTERRUPTn source IRQ14) */
  MU4_MUB_IRQn                 = 47,               /**< MU4_MUB (HIFI4_INTTERRUPTn source IRQ15) */
  WWDT0_IRQn                   = 48,               /**< WWDT0 (HIFI4_INTTERRUPTn source IRQ16) */
  WWDT1_IRQn                   = 49,               /**< WWDT1 (HIFI4_INTTERRUPTn source IRQ17) */
  UTICK0_IRQn                  = 50,               /**< UTICK0 (HIFI4_INTTERRUPTn source IRQ18) */
  LPSPI14_IRQn                 = 51,               /**< LPSPI14 (HIFI4_INTTERRUPTn source IRQ19) */
  MRT0_IRQn                    = 52,               /**< MRT0 (HIFI4_INTTERRUPTn source IRQ20) */
  OSTIMER_IRQn                 = 53,               /**< OSTIMER (HIFI4_INTTERRUPTn source IRQ21) */
  CTIMER0_IRQn                 = 54,               /**< CTIMER0 (HIFI4_INTTERRUPTn source IRQ22) */
  CTIMER1_IRQn                 = 55,               /**< CTIMER1 (HIFI4_INTTERRUPTn source IRQ23) */
  CTIMER2_IRQn                 = 56,               /**< CTIMER2 (HIFI4_INTTERRUPTn source IRQ24) */
  CTIMER3_IRQn                 = 57,               /**< CTIMER3 (HIFI4_INTTERRUPTn source IRQ25) */
  CTIMER4_IRQn                 = 58,               /**< CTIMER4 (HIFI4_INTTERRUPTn source IRQ26) */
  RTC0_IRQn                    = 59,               /**< RTC0 (HIFI4_INTTERRUPTn source IRQ27) */
  RTC_SS0_IRQn                 = 60,               /**< RTC_SS0 (HIFI4_INTTERRUPTn source IRQ28) */
  I3C0_IRQn                    = 61,               /**< I3C0 (HIFI4_INTTERRUPTn source IRQ29) */
  I3C1_IRQn                    = 62,               /**< I3C1 (HIFI4_INTTERRUPTn source IRQ30) */
  PDM_EVENT_IRQn               = 63,               /**< MICFIL (HIFI4_INTTERRUPTn source IRQ31) */
  PDM_HWVAD_EVENT_IRQn         = 64,               /**< MICFIL HARDWARE (HIFI4_INTTERRUPTn source IRQ32) */
  LCDIF_IRQn                   = 65,               /**< LCDIF (HIFI4_INTTERRUPTn source IRQ33) */
  VGPU_IRQn                    = 66,               /**< VGPU (HIFI4_INTTERRUPTn source IRQ34) */
  EZH_V_IRQn                   = 67,               /**< EZH_V (HIFI4_INTTERRUPTn source IRQ35) */
  FLEXIO_IRQn                  = 68,               /**< FLEXIO (HIFI4_INTTERRUPTn source IRQ36) */
  LPSPI16_IRQn                 = 69,               /**< LPSPI16 (HIFI4_INTTERRUPTn source IRQ37) */
  EDMA0_CH0_IRQn               = 70,               /**< EDMA0_CH0 (HIFI4_INTTERRUPTn source IRQ38) */
  EDMA0_CH1_IRQn               = 71,               /**< EDMA0_CH1 (HIFI4_INTTERRUPTn source IRQ39) */
  EDMA0_CH2_IRQn               = 72,               /**< EDMA0_CH2 (HIFI4_INTTERRUPTn source IRQ40) */
  EDMA0_CH3_IRQn               = 73,               /**< EDMA0_CH3 (HIFI4_INTTERRUPTn source IRQ41) */
  EDMA0_CH4_IRQn               = 74,               /**< EDMA0_CH4 (HIFI4_INTTERRUPTn source IRQ42) */
  EDMA0_CH5_IRQn               = 75,               /**< EDMA0_CH5 (HIFI4_INTTERRUPTn source IRQ43) */
  EDMA0_CH6_IRQn               = 76,               /**< EDMA0_CH6 (HIFI4_INTTERRUPTn source IRQ44) */
  EDMA0_CH7_IRQn               = 77,               /**< EDMA0_CH7 (HIFI4_INTTERRUPTn source IRQ45) */
  EDMA0_CH8_IRQn               = 78,               /**< EDMA0_CH8 (HIFI4_INTTERRUPTn source IRQ46) */
  EDMA0_CH9_IRQn               = 79,               /**< EDMA0_CH9 (HIFI4_INTTERRUPTn source IRQ47) */
  EDMA0_CH10_IRQn              = 80,               /**< EDMA0_CH10 (HIFI4_INTTERRUPTn source IRQ48) */
  EDMA0_CH11_IRQn              = 81,               /**< EDMA0_CH11 (HIFI4_INTTERRUPTn source IRQ49) */
  EDMA0_CH12_IRQn              = 82,               /**< EDMA0_CH12 (HIFI4_INTTERRUPTn source IRQ50) */
  EDMA0_CH13_IRQn              = 83,               /**< EDMA0_CH13 (HIFI4_INTTERRUPTn source IRQ51) */
  EDMA0_CH14_IRQn              = 84,               /**< EDMA0_CH14 (HIFI4_INTTERRUPTn source IRQ52) */
  EDMA0_CH15_IRQn              = 85,               /**< EDMA0_CH15 (HIFI4_INTTERRUPTn source IRQ53) */
  EDMA1_CH0_IRQn               = 86,               /**< EDMA1_CH0 (HIFI4_INTTERRUPTn source IRQ54) */
  EDMA1_CH1_IRQn               = 87,               /**< EDMA1_CH1 (HIFI4_INTTERRUPTn source IRQ55) */
  EDMA1_CH2_IRQn               = 88,               /**< EDMA1_CH2 (HIFI4_INTTERRUPTn source IRQ56) */
  EDMA1_CH3_IRQn               = 89,               /**< EDMA1_CH3 (HIFI4_INTTERRUPTn source IRQ57) */
  EDMA1_CH4_IRQn               = 90,               /**< EDMA1_CH4 (HIFI4_INTTERRUPTn source IRQ58) */
  EDMA1_CH5_IRQn               = 91,               /**< EDMA1_CH5 (HIFI4_INTTERRUPTn source IRQ59) */
  EDMA1_CH6_IRQn               = 92,               /**< EDMA1_CH6 (HIFI4_INTTERRUPTn source IRQ60) */
  EDMA1_CH7_IRQn               = 93,               /**< EDMA1_CH7 (HIFI4_INTTERRUPTn source IRQ61) */
  EDMA1_CH8_IRQn               = 94,               /**< EDMA1_CH8 (HIFI4_INTTERRUPTn source IRQ62) */
  EDMA1_CH9_IRQn               = 95,               /**< EDMA1_CH9 (HIFI4_INTTERRUPTn source IRQ63) */
  EDMA1_CH10_IRQn              = 96,               /**< EDMA1_CH10 (HIFI4_INTTERRUPTn source IRQ64) */
  EDMA1_CH11_IRQn              = 97,               /**< EDMA1_CH11 (HIFI4_INTTERRUPTn source IRQ65) */
  EDMA1_CH12_IRQn              = 98,               /**< EDMA1_CH12 (HIFI4_INTTERRUPTn source IRQ66) */
  EDMA1_CH13_IRQn              = 99,               /**< EDMA1_CH13 (HIFI4_INTTERRUPTn source IRQ67) */
  EDMA1_CH14_IRQn              = 100,              /**< EDMA1_CH14 (HIFI4_INTTERRUPTn source IRQ68) */
  EDMA1_CH15_IRQn              = 101,              /**< EDMA1_CH15 (HIFI4_INTTERRUPTn source IRQ69) */
  GPIO0_CH0_IRQn               = 102,              /**< GPIO0_CH0 (HIFI4_INTTERRUPTn source IRQ70) */
  GPIO0_CH1_IRQn               = 103,              /**< GPIO0_CH1 (HIFI4_INTTERRUPTn source IRQ71) */
  GPIO1_CH0_IRQn               = 104,              /**< GPIO1_CH0 (HIFI4_INTTERRUPTn source IRQ72) */
  GPIO1_CH1_IRQn               = 105,              /**< GPIO1_CH1 (HIFI4_INTTERRUPTn source IRQ73) */
  GPIO2_CH0_IRQn               = 106,              /**< GPIO2_CH0 (HIFI4_INTTERRUPTn source IRQ74) */
  GPIO2_CH1_IRQn               = 107,              /**< GPIO2_CH1 (HIFI4_INTTERRUPTn source IRQ75) */
  GPIO3_CH0_IRQn               = 108,              /**< GPIO3_CH0 (HIFI4_INTTERRUPTn source IRQ76) */
  GPIO3_CH1_IRQn               = 109,              /**< GPIO3_CH1 (HIFI4_INTTERRUPTn source IRQ77) */
  GPIO4_CH0_IRQn               = 110,              /**< GPIO4_CH0 (HIFI4_INTTERRUPTn source IRQ78) */
  GPIO4_CH1_IRQn               = 111,              /**< GPIO4_CH1 (HIFI4_INTTERRUPTn source IRQ79) */
  GPIO5_CH0_IRQn               = 112,              /**< GPIO5_CH0 (HIFI4_INTTERRUPTn source IRQ80) */
  GPIO5_CH1_IRQn               = 113,              /**< GPIO5_CH1 (HIFI4_INTTERRUPTn source IRQ81) */
  GPIO6_CH0_IRQn               = 114,              /**< GPIO6_CH0 (HIFI4_INTTERRUPTn source IRQ82) */
  GPIO6_CH1_IRQn               = 115,              /**< GPIO6_CH1 (HIFI4_INTTERRUPTn source IRQ83) */
  GPIO7_CH0_IRQn               = 116,              /**< GPIO7_CH0 (HIFI4_INTTERRUPTn source IRQ84) */
  GPIO7_CH1_IRQn               = 117,              /**< GPIO7_CH1 (HIFI4_INTTERRUPTn source IRQ85) */
  PIN_INT0_IRQn                = 118,              /**< Pin interrupt0 (HIFI4_INTTERRUPTn source IRQ86) */
  PIN_INT1_IRQn                = 119,              /**< Pin interrupt1 (HIFI4_INTTERRUPTn source IRQ87) */
  PIN_INT2_IRQn                = 120,              /**< Pin interrupt2 (HIFI4_INTTERRUPTn source IRQ88) */
  PIN_INT3_IRQn                = 121,              /**< Pin interrupt3 (HIFI4_INTTERRUPTn source IRQ89) */
  PIN_INT4_IRQn                = 122,              /**< Pin interrupt4 (HIFI4_INTTERRUPTn source IRQ90) */
  PIN_INT5_IRQn                = 123,              /**< Pin interrupt5 (HIFI4_INTTERRUPTn source IRQ91) */
  PIN_INT6_IRQn                = 124,              /**< Pin interrupt6 (HIFI4_INTTERRUPTn source IRQ92) */
  PIN_INT7_IRQn                = 125,              /**< Pin interrupt7 (HIFI4_INTTERRUPTn source IRQ93) */
  SAI0_TX_RX_IRQn              = 126,              /**< SAI0_TX_RX (HIFI4_INTTERRUPTn source IRQ94) */
  SAI1_TX_RX_IRQn              = 127,              /**< SAI1_TX_RX (HIFI4_INTTERRUPTn source IRQ95) */
  SAI2_TX_RX_IRQn              = 128,              /**< SAI2_TX_RX (HIFI4_INTTERRUPTn source IRQ96) */
  XSPI0_IRQn                   = 129,              /**< XSPI0 (HIFI4_INTTERRUPTn source IRQ97) */
  XSPI1_IRQn                   = 130,              /**< XSPI1 (HIFI4_INTTERRUPTn source IRQ98) */
  XSPI2_IRQn                   = 131,              /**< XSPI2 (HIFI4_INTTERRUPTn source IRQ99) */
  JPGDECWRP_IRQn               = 132,              /**< JPGDECWRP (HIFI4_INTTERRUPTn source IRQ100) */
  PNGDEC_IRQn                  = 133,              /**< PNGDEC (HIFI4_INTTERRUPTn source IRQ101) */
  NPU_IRQn                     = 134,              /**< NPU (HIFI4_INTTERRUPTn source IRQ102 */
  PMC0_IRQn                    = 135               /**< PMC0 (HIFI4_INTTERRUPTn source IRQ103) */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers */


#ifndef MIMXRT798S_hifi4_SERIES
#define MIMXRT798S_hifi4_SERIES
#endif
/* CPU specific feature definitions */
#include "MIMXRT798S_hifi4_features.h"

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
/*!
 * @addtogroup edma_request
 * @{
 */

