zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/MIMXRT798S_hifi4_COMMON.h
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections.
 */
typedef enum _dma_request_source
{
    kDmaRequestMuxDisabled          = 0U,          /**< Unused DMA request 0 */
    kDmaRequestMuxMicfil            = 1U,          /**< MICFIL FIFO_request */
    kDmaRequestMuxXspi0Rx           = 2U,          /**< XSPI0 Receive */
    kDmaRequestMuxXspi0Tx           = 3U,          /**< XSPI0 Transmit */
    kDmaRequestMuxXspi1Rx           = 4U,          /**< XSPI1 Receive */
    kDmaRequestMuxXspi1Tx           = 5U,          /**< XSPI1 Transmit */
    kDmaRequestMuxXspi2Rx           = 6U,          /**< XSPI2 Receive */
    kDmaRequestMuxXspi2Tx           = 7U,          /**< XSPI2 Transmit */
    kDmaRequestMuxPinInt0           = 8U,          /**< PINT INT0 */
    kDmaRequestMuxPinInt1           = 9U,          /**< PINT INT1 */
    kDmaRequestMuxPinInt2           = 10U,         /**< PINT INT2 */
    kDmaRequestMuxPinInt3           = 11U,         /**< PINT INT3 */
    kDmaRequestMuxPinInt4           = 12U,         /**< PINT INT4 */
    kDmaRequestMuxPinInt5           = 13U,         /**< PINT INT5 */
    kDmaRequestMuxPinInt6           = 14U,         /**< PINT INT6 */
    kDmaRequestMuxPinInt7           = 15U,         /**< PINT INT7 */
    kDmaRequestMuxCtimer0M0         = 16U,         /**< CTIMER0 Match channel 0 request */
    kDmaRequestMuxCtimer0M1         = 17U,         /**< CTIMER0 Match channel 1 request */
    kDmaRequestMuxCtimer1M0         = 18U,         /**< CTIMER1 Match channel 0 request */
    kDmaRequestMuxCtimer1M1         = 19U,         /**< CTIMER1 Match channel 1 request */
    kDmaRequestMuxCtimer2M0         = 20U,         /**< CTIMER2 Match channel 0 request */
    kDmaRequestMuxCtimer2M1         = 21U,         /**< CTIMER2 Match channel 1 request */
    kDmaRequestMuxCtimer3M0         = 22U,         /**< CTIMER3 Match channel 0 request */
    kDmaRequestMuxCtimer3M1         = 23U,         /**< CTIMER3 Match channel 1 request */
    kDmaRequestMuxCtimer4M0         = 24U,         /**< CTIMER4 Match channel 0 request */
    kDmaRequestMuxCtimer4M1         = 25U,         /**< CTIMER4 Match channel 1 request */
    kDmaRequestMuxSct0Dma0          = 26U,         /**< SCT0 DMA0 */
    kDmaRequestMuxSct0Dma1          = 27U,         /**< SCT0 DMA1 */
    kDmaRequestMuxAdc0FifoARequest  = 28U,         /**< ADC0 FIFO A request */
    kDmaRequestMuxAdc0FifoBRequest  = 29U,         /**< ADC0 FIFO B request */
    kDmaRequestMuxSdAdcFifo0Request = 30U,         /**< SDADC0 FIFO 0 request */
    kDmaRequestMuxSdAdcFifo1Request = 31U,         /**< SDADC0 FIFO 1 request */
    kDmaRequestMuxSdAdcFifo2Request = 32U,         /**< SDADC0 FIFO 2 request */
    kDmaRequestMuxSdAdcFifo3Request = 33U,         /**< SDADC0 FIFO 3 request */
    kDmaRequestMuxCmpDmaRequest     = 34U,         /**< CMP DMA request */
    kDmaRequestMuxItrc0TmprOut0     = 35U,         /**< ITRC0 TMPR_OUT0 */
    kDmaRequestMuxItrc0TmprOut1     = 36U,         /**< ITRC0 TMPR_OUT1 */
    kDmaRequestMuxFlexIO0ShiftRegister0Request = 37U, /**< FlexIO0 Shifter0 Status DMA request OR Timer0 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister1Request = 38U, /**< FlexIO0 Shifter1 Status DMA request OR Timer1 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister2Request = 39U, /**< FlexIO0 Shifter2 Status DMA request OR Timer2 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister3Request = 40U, /**< FlexIO0 Shifter3 Status DMA request OR Timer3 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister4Request = 41U, /**< FlexIO0 Shifter4 Status DMA request OR Timer4 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister5Request = 42U, /**< FlexIO0 Shifter5 Status DMA request OR Timer5 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister6Request = 43U, /**< FlexIO0 Shifter6 Status DMA request OR Timer6 Status DMA request */
    kDmaRequestMuxFlexIO0ShiftRegister7Request = 44U, /**< FlexIO0 Shifter7 Status DMA request OR Timer7 Status DMA request */
    kDmaRequestMuxLpFlexcomm0Rx     = 45U,         /**< LP_FLEXCOMM0 Receive request */
    kDmaRequestMuxLpFlexcomm0Tx     = 46U,         /**< LP_FLEXCOMM0 Transmit request */
    kDmaRequestMuxLpFlexcomm1Rx     = 47U,         /**< LP_FLEXCOMM1 Receive request */
    kDmaRequestMuxLpFlexcomm1Tx     = 48U,         /**< LP_FLEXCOMM1 Transmit request */
    kDmaRequestMuxLpFlexcomm2Rx     = 49U,         /**< LP_FLEXCOMM2 Receive request */
    kDmaRequestMuxLpFlexcomm2Tx     = 50U,         /**< LP_FLEXCOMM2 Transmit request */
    kDmaRequestMuxLpFlexcomm3Rx     = 51U,         /**< LP_FLEXCOMM3 Receive request */
    kDmaRequestMuxLpFlexcomm3Tx     = 52U,         /**< LP_FLEXCOMM3 Transmit request */
    kDmaRequestMuxLpFlexcomm4Rx     = 53U,         /**< LP_FLEXCOMM4 Receive request */
    kDmaRequestMuxLpFlexcomm4Tx     = 54U,         /**< LP_FLEXCOMM4 Transmit request */
    kDmaRequestMuxLpFlexcomm5Rx     = 55U,         /**< LP_FLEXCOMM5 Receive request */
    kDmaRequestMuxLpFlexcomm5Tx     = 56U,         /**< LP_FLEXCOMM5 Transmit request */
    kDmaRequestMuxLpFlexcomm6Rx     = 57U,         /**< LP_FLEXCOMM6 Receive request */
    kDmaRequestMuxLpFlexcomm6Tx     = 58U,         /**< LP_FLEXCOMM6 Transmit request */
    kDmaRequestMuxLpFlexcomm7Rx     = 59U,         /**< LP_FLEXCOMM7 Receive request */
    kDmaRequestMuxLpFlexcomm7Tx     = 60U,         /**< LP_FLEXCOMM7 Transmit request */
    kDmaRequestMuxLpFlexcomm8Rx     = 61U,         /**< LP_FLEXCOMM8 Receive request */
    kDmaRequestMuxLpFlexcomm8Tx     = 62U,         /**< LP_FLEXCOMM8 Transmit request */
    kDmaRequestMuxLpFlexcomm9Rx     = 63U,         /**< LP_FLEXCOMM9 Receive request */
    kDmaRequestMuxLpFlexcomm9Tx     = 64U,         /**< LP_FLEXCOMM9 Transmit request */
    kDmaRequestMuxLpFlexcomm10Rx    = 65U,         /**< LP_FLEXCOMM10 Receive request */
    kDmaRequestMuxLpFlexcomm10Tx    = 66U,         /**< LP_FLEXCOMM10 Transmit request */
    kDmaRequestMuxLpFlexcomm11Rx    = 67U,         /**< LP_FLEXCOMM11 Receive request */
    kDmaRequestMuxLpFlexcomm11Tx    = 68U,         /**< LP_FLEXCOMM11 Transmit request */
    kDmaRequestMuxLpFlexcomm12Rx    = 69U,         /**< LP_FLEXCOMM12 Receive request */
    kDmaRequestMuxLpFlexcomm12Tx    = 70U,         /**< LP_FLEXCOMM12 Transmit request */
    kDmaRequestMuxLpFlexcomm13Rx    = 71U,         /**< LP_FLEXCOMM13 Receive request */
    kDmaRequestMuxLpFlexcomm13Tx    = 72U,         /**< LP_FLEXCOMM13 Transmit request */
    kDmaRequestMuxLpspi14Rx         = 73U,         /**< LPSPI14 Receive request */
    kDmaRequestMuxLpspi14Tx         = 74U,         /**< LPSPI14 Transmit request */
    kDmaRequestMuxLpspi16Rx         = 75U,         /**< LPSPI16 Receive request */
    kDmaRequestMuxLpspi16Tx         = 76U,         /**< LPSPI16 Transmit request */
    kDmaRequestMuxI3c0Tx            = 77U,         /**< I3C0 Transmit request */
    kDmaRequestMuxI3c0Rx            = 78U,         /**< I3C0 Receive request */
    kDmaRequestMuxI3c1Tx            = 79U,         /**< I3C1 Transmit request */
    kDmaRequestMuxI3c1Rx            = 80U,         /**< I3C1 Receive request */
    kDmaRequestMuxSai0Rx            = 81U,         /**< SAI0 Receive request */
    kDmaRequestMuxSai0Tx            = 82U,         /**< SAI0 Transmit request */
    kDmaRequestMuxSai1Rx            = 83U,         /**< SAI1 Receive request */
    kDmaRequestMuxSai1Tx            = 84U,         /**< SAI1 Transmit request */
    kDmaRequestMuxSai2Rx            = 85U,         /**< SAI2 Receive request */
    kDmaRequestMuxSai2Tx            = 86U,         /**< SAI2 Transmit request */
    kDmaRequestMuxGpio0PinEventRequest0 = 87U,     /**< GPIO0 Pin event request 0 */
    kDmaRequestMuxGpio0PinEventRequest1 = 88U,     /**< GPIO0 Pin event request 1 */
    kDmaRequestMuxGpio1PinEventRequest0 = 89U,     /**< GPIO1 Pin event request 0 */
    kDmaRequestMuxGpio1PinEventRequest1 = 90U,     /**< GPIO1 Pin event request 1 */
    kDmaRequestMuxGpio2PinEventRequest0 = 91U,     /**< GPIO2 Pin event request 0 */
    kDmaRequestMuxGpio2PinEventRequest1 = 92U,     /**< GPIO2 Pin event request 1 */
    kDmaRequestMuxGpio3PinEventRequest0 = 93U,     /**< GPIO3 Pin event request 0 */
    kDmaRequestMuxGpio3PinEventRequest1 = 94U,     /**< GPIO3 Pin event request 1 */
    kDmaRequestMuxGpio4PinEventRequest0 = 95U,     /**< GPIO4 Pin event request 0 */
    kDmaRequestMuxGpio4PinEventRequest1 = 96U,     /**< GPIO4 Pin event request 1 */
    kDmaRequestMuxGpio5PinEventRequest0 = 97U,     /**< GPIO5 Pin event request 0 */
    kDmaRequestMuxGpio5PinEventRequest1 = 98U,     /**< GPIO5 Pin event request 1 */
    kDmaRequestMuxGpio6PinEventRequest0 = 99U,     /**< GPIO6 Pin event request 0 */
    kDmaRequestMuxGpio6PinEventRequest1 = 100U,    /**< GPIO6 Pin event request 1 */
    kDmaRequestMuxGpio7PinEventRequest0 = 101U,    /**< GPIO7 Pin event request 0 */
    kDmaRequestMuxGpio7PinEventRequest1 = 102U,    /**< GPIO7 Pin event request 1 */
    kDmaRequestMuxLpi2c15Rx         = 103U,        /**< LPI2C15 receive request */
    kDmaRequestMuxLpi2c15Tx         = 104U,        /**< LPI2C15 transmit request */
} dma_request_source_t;

/* @} */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ADC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral ADC0 base address */
  #define ADC0_BASE                                (0x5020C000u)
  /** Peripheral ADC0 base address */
  #define ADC0_BASE_NS                             (0x4020C000u)
  /** Peripheral ADC0 base pointer */
  #define ADC0                                     ((ADC_Type *)ADC0_BASE)
  /** Peripheral ADC0 base pointer */
  #define ADC0_NS                                  ((ADC_Type *)ADC0_BASE_NS)
  /** Array initializer of ADC peripheral base addresses */
  #define ADC_BASE_ADDRS                           { ADC0_BASE }
  /** Array initializer of ADC peripheral base pointers */
  #define ADC_BASE_PTRS                            { ADC0 }
  /** Array initializer of ADC peripheral base addresses */
  #define ADC_BASE_ADDRS_NS                        { ADC0_BASE_NS }
  /** Array initializer of ADC peripheral base pointers */
  #define ADC_BASE_PTRS_NS                         { ADC0_NS }
#else
  /** Peripheral ADC0 base address */
  #define ADC0_BASE                                (0x4020C000u)
  /** Peripheral ADC0 base pointer */
  #define ADC0                                     ((ADC_Type *)ADC0_BASE)
  /** Array initializer of ADC peripheral base addresses */
  #define ADC_BASE_ADDRS                           { ADC0_BASE }
  /** Array initializer of ADC peripheral base pointers */
  #define ADC_BASE_PTRS                            { ADC0 }
#endif

/* AHBSC0 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AHBSC0 base address */
  #define AHBSC0_BASE                              (0x5017C000u)
  /** Peripheral AHBSC0 base address */
  #define AHBSC0_BASE_NS                           (0x4017C000u)
  /** Peripheral AHBSC0 base pointer */
  #define AHBSC0                                   ((AHBSC0_Type *)AHBSC0_BASE)
  /** Peripheral AHBSC0 base pointer */
  #define AHBSC0_NS                                ((AHBSC0_Type *)AHBSC0_BASE_NS)
  /** Peripheral AHBSC0_ALIAS1 base address */
  #define AHBSC0_ALIAS1_BASE                       (0x5017D000u)
  /** Peripheral AHBSC0_ALIAS1 base address */
  #define AHBSC0_ALIAS1_BASE_NS                    (0x4017D000u)
  /** Peripheral AHBSC0_ALIAS1 base pointer */
  #define AHBSC0_ALIAS1                            ((AHBSC0_Type *)AHBSC0_ALIAS1_BASE)
  /** Peripheral AHBSC0_ALIAS1 base pointer */
  #define AHBSC0_ALIAS1_NS                         ((AHBSC0_Type *)AHBSC0_ALIAS1_BASE_NS)
  /** Peripheral AHBSC0_ALIAS2 base address */
  #define AHBSC0_ALIAS2_BASE                       (0x5017E000u)
  /** Peripheral AHBSC0_ALIAS2 base address */
  #define AHBSC0_ALIAS2_BASE_NS                    (0x4017E000u)
  /** Peripheral AHBSC0_ALIAS2 base pointer */
  #define AHBSC0_ALIAS2                            ((AHBSC0_Type *)AHBSC0_ALIAS2_BASE)
  /** Peripheral AHBSC0_ALIAS2 base pointer */
  #define AHBSC0_ALIAS2_NS                         ((AHBSC0_Type *)AHBSC0_ALIAS2_BASE_NS)
  /** Peripheral AHBSC0_ALIAS3 base address */
  #define AHBSC0_ALIAS3_BASE                       (0x5017F000u)
  /** Peripheral AHBSC0_ALIAS3 base address */
  #define AHBSC0_ALIAS3_BASE_NS                    (0x4017F000u)
  /** Peripheral AHBSC0_ALIAS3 base pointer */
  #define AHBSC0_ALIAS3                            ((AHBSC0_Type *)AHBSC0_ALIAS3_BASE)
  /** Peripheral AHBSC0_ALIAS3 base pointer */
  #define AHBSC0_ALIAS3_NS                         ((AHBSC0_Type *)AHBSC0_ALIAS3_BASE_NS)
  /** Array initializer of AHBSC0 peripheral base addresses */
  #define AHBSC0_BASE_ADDRS                        { AHBSC0_BASE, AHBSC0_ALIAS1_BASE, AHBSC0_ALIAS2_BASE, AHBSC0_ALIAS3_BASE }
  /** Array initializer of AHBSC0 peripheral base pointers */
  #define AHBSC0_BASE_PTRS                         { AHBSC0, AHBSC0_ALIAS1, AHBSC0_ALIAS2, AHBSC0_ALIAS3 }
  /** Array initializer of AHBSC0 peripheral base addresses */
  #define AHBSC0_BASE_ADDRS_NS                     { AHBSC0_BASE_NS, AHBSC0_ALIAS1_BASE_NS, AHBSC0_ALIAS2_BASE_NS, AHBSC0_ALIAS3_BASE_NS }
  /** Array initializer of AHBSC0 peripheral base pointers */
  #define AHBSC0_BASE_PTRS_NS                      { AHBSC0_NS, AHBSC0_ALIAS1_NS, AHBSC0_ALIAS2_NS, AHBSC0_ALIAS3_NS }
#else
  /** Peripheral AHBSC0 base address */
  #define AHBSC0_BASE                              (0x4017C000u)
  /** Peripheral AHBSC0 base pointer */
  #define AHBSC0                                   ((AHBSC0_Type *)AHBSC0_BASE)
  /** Peripheral AHBSC0_ALIAS1 base address */
  #define AHBSC0_ALIAS1_BASE                       (0x4017D000u)
  /** Peripheral AHBSC0_ALIAS1 base pointer */
  #define AHBSC0_ALIAS1                            ((AHBSC0_Type *)AHBSC0_ALIAS1_BASE)
  /** Peripheral AHBSC0_ALIAS2 base address */
  #define AHBSC0_ALIAS2_BASE                       (0x4017E000u)
  /** Peripheral AHBSC0_ALIAS2 base pointer */
  #define AHBSC0_ALIAS2                            ((AHBSC0_Type *)AHBSC0_ALIAS2_BASE)
  /** Peripheral AHBSC0_ALIAS3 base address */
  #define AHBSC0_ALIAS3_BASE                       (0x4017F000u)
  /** Peripheral AHBSC0_ALIAS3 base pointer */
  #define AHBSC0_ALIAS3                            ((AHBSC0_Type *)AHBSC0_ALIAS3_BASE)
  /** Array initializer of AHBSC0 peripheral base addresses */
  #define AHBSC0_BASE_ADDRS                        { AHBSC0_BASE, AHBSC0_ALIAS1_BASE, AHBSC0_ALIAS2_BASE, AHBSC0_ALIAS3_BASE }
  /** Array initializer of AHBSC0 peripheral base pointers */
  #define AHBSC0_BASE_PTRS                         { AHBSC0, AHBSC0_ALIAS1, AHBSC0_ALIAS2, AHBSC0_ALIAS3 }
#endif

/* AHBSC3 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AHBSC3 base address */
  #define AHBSC3_BASE                              (0x50220000u)
  /** Peripheral AHBSC3 base address */
  #define AHBSC3_BASE_NS                           (0x40220000u)
  /** Peripheral AHBSC3 base pointer */
  #define AHBSC3                                   ((AHBSC3_Type *)AHBSC3_BASE)
  /** Peripheral AHBSC3 base pointer */
  #define AHBSC3_NS                                ((AHBSC3_Type *)AHBSC3_BASE_NS)
  /** Peripheral AHBSC3_ALIAS1 base address */
  #define AHBSC3_ALIAS1_BASE                       (0x50221000u)
  /** Peripheral AHBSC3_ALIAS1 base address */
  #define AHBSC3_ALIAS1_BASE_NS                    (0x40221000u)
  /** Peripheral AHBSC3_ALIAS1 base pointer */
  #define AHBSC3_ALIAS1                            ((AHBSC3_Type *)AHBSC3_ALIAS1_BASE)
  /** Peripheral AHBSC3_ALIAS1 base pointer */
  #define AHBSC3_ALIAS1_NS                         ((AHBSC3_Type *)AHBSC3_ALIAS1_BASE_NS)
  /** Peripheral AHBSC3_ALIAS2 base address */
  #define AHBSC3_ALIAS2_BASE                       (0x50222000u)
  /** Peripheral AHBSC3_ALIAS2 base address */
  #define AHBSC3_ALIAS2_BASE_NS                    (0x40222000u)
  /** Peripheral AHBSC3_ALIAS2 base pointer */
  #define AHBSC3_ALIAS2                            ((AHBSC3_Type *)AHBSC3_ALIAS2_BASE)
  /** Peripheral AHBSC3_ALIAS2 base pointer */
  #define AHBSC3_ALIAS2_NS                         ((AHBSC3_Type *)AHBSC3_ALIAS2_BASE_NS)
  /** Peripheral AHBSC3_ALIAS3 base address */
  #define AHBSC3_ALIAS3_BASE                       (0x50223000u)
  /** Peripheral AHBSC3_ALIAS3 base address */
  #define AHBSC3_ALIAS3_BASE_NS                    (0x40223000u)
  /** Peripheral AHBSC3_ALIAS3 base pointer */
  #define AHBSC3_ALIAS3                            ((AHBSC3_Type *)AHBSC3_ALIAS3_BASE)
  /** Peripheral AHBSC3_ALIAS3 base pointer */
  #define AHBSC3_ALIAS3_NS                         ((AHBSC3_Type *)AHBSC3_ALIAS3_BASE_NS)
  /** Array initializer of AHBSC3 peripheral base addresses */
  #define AHBSC3_BASE_ADDRS                        { AHBSC3_BASE, AHBSC3_ALIAS1_BASE, AHBSC3_ALIAS2_BASE, AHBSC3_ALIAS3_BASE }
  /** Array initializer of AHBSC3 peripheral base pointers */
  #define AHBSC3_BASE_PTRS                         { AHBSC3, AHBSC3_ALIAS1, AHBSC3_ALIAS2, AHBSC3_ALIAS3 }
  /** Array initializer of AHBSC3 peripheral base addresses */
  #define AHBSC3_BASE_ADDRS_NS                     { AHBSC3_BASE_NS, AHBSC3_ALIAS1_BASE_NS, AHBSC3_ALIAS2_BASE_NS, AHBSC3_ALIAS3_BASE_NS }
  /** Array initializer of AHBSC3 peripheral base pointers */
  #define AHBSC3_BASE_PTRS_NS                      { AHBSC3_NS, AHBSC3_ALIAS1_NS, AHBSC3_ALIAS2_NS, AHBSC3_ALIAS3_NS }
#else
  /** Peripheral AHBSC3 base address */
  #define AHBSC3_BASE                              (0x40220000u)
  /** Peripheral AHBSC3 base pointer */
  #define AHBSC3                                   ((AHBSC3_Type *)AHBSC3_BASE)
  /** Peripheral AHBSC3_ALIAS1 base address */
  #define AHBSC3_ALIAS1_BASE                       (0x40221000u)
  /** Peripheral AHBSC3_ALIAS1 base pointer */
  #define AHBSC3_ALIAS1                            ((AHBSC3_Type *)AHBSC3_ALIAS1_BASE)
  /** Peripheral AHBSC3_ALIAS2 base address */
  #define AHBSC3_ALIAS2_BASE                       (0x40222000u)
  /** Peripheral AHBSC3_ALIAS2 base pointer */
  #define AHBSC3_ALIAS2                            ((AHBSC3_Type *)AHBSC3_ALIAS2_BASE)
  /** Peripheral AHBSC3_ALIAS3 base address */
  #define AHBSC3_ALIAS3_BASE                       (0x40223000u)
  /** Peripheral AHBSC3_ALIAS3 base pointer */
  #define AHBSC3_ALIAS3                            ((AHBSC3_Type *)AHBSC3_ALIAS3_BASE)
  /** Array initializer of AHBSC3 peripheral base addresses */
  #define AHBSC3_BASE_ADDRS                        { AHBSC3_BASE, AHBSC3_ALIAS1_BASE, AHBSC3_ALIAS2_BASE, AHBSC3_ALIAS3_BASE }
  /** Array initializer of AHBSC3 peripheral base pointers */
  #define AHBSC3_BASE_PTRS                         { AHBSC3, AHBSC3_ALIAS1, AHBSC3_ALIAS2, AHBSC3_ALIAS3 }
#endif

/* AHBSC4 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral AHBSC4 base address */
  #define AHBSC4_BASE                              (0x50400000u)
  /** Peripheral AHBSC4 base address */
  #define AHBSC4_BASE_NS                           (0x40400000u)
  /** Peripheral AHBSC4 base pointer */
  #define AHBSC4                                   ((AHBSC4_Type *)AHBSC4_BASE)
  /** Peripheral AHBSC4 base pointer */
  #define AHBSC4_NS                                ((AHBSC4_Type *)AHBSC4_BASE_NS)
  /** Peripheral AHBSC4_ALIAS1 base address */
  #define AHBSC4_ALIAS1_BASE                       (0x50401000u)
  /** Peripheral AHBSC4_ALIAS1 base address */
  #define AHBSC4_ALIAS1_BASE_NS                    (0x40401000u)
  /** Peripheral AHBSC4_ALIAS1 base pointer */
  #define AHBSC4_ALIAS1                            ((AHBSC4_Type *)AHBSC4_ALIAS1_BASE)
  /** Peripheral AHBSC4_ALIAS1 base pointer */
  #define AHBSC4_ALIAS1_NS                         ((AHBSC4_Type *)AHBSC4_ALIAS1_BASE_NS)
  /** Peripheral AHBSC4_ALIAS2 base address */
  #define AHBSC4_ALIAS2_BASE                       (0x50402000u)
  /** Peripheral AHBSC4_ALIAS2 base address */
  #define AHBSC4_ALIAS2_BASE_NS                    (0x40402000u)
  /** Peripheral AHBSC4_ALIAS2 base pointer */
  #define AHBSC4_ALIAS2                            ((AHBSC4_Type *)AHBSC4_ALIAS2_BASE)
  /** Peripheral AHBSC4_ALIAS2 base pointer */
  #define AHBSC4_ALIAS2_NS                         ((AHBSC4_Type *)AHBSC4_ALIAS2_BASE_NS)
  /** Peripheral AHBSC4_ALIAS3 base address */
  #define AHBSC4_ALIAS3_BASE                       (0x50403000u)
  /** Peripheral AHBSC4_ALIAS3 base address */
  #define AHBSC4_ALIAS3_BASE_NS                    (0x40403000u)
  /** Peripheral AHBSC4_ALIAS3 base pointer */
  #define AHBSC4_ALIAS3                            ((AHBSC4_Type *)AHBSC4_ALIAS3_BASE)
  /** Peripheral AHBSC4_ALIAS3 base pointer */
  #define AHBSC4_ALIAS3_NS                         ((AHBSC4_Type *)AHBSC4_ALIAS3_BASE_NS)
  /** Array initializer of AHBSC4 peripheral base addresses */
  #define AHBSC4_BASE_ADDRS                        { AHBSC4_BASE, AHBSC4_ALIAS1_BASE, AHBSC4_ALIAS2_BASE, AHBSC4_ALIAS3_BASE }
  /** Array initializer of AHBSC4 peripheral base pointers */
  #define AHBSC4_BASE_PTRS                         { AHBSC4, AHBSC4_ALIAS1, AHBSC4_ALIAS2, AHBSC4_ALIAS3 }
  /** Array initializer of AHBSC4 peripheral base addresses */
  #define AHBSC4_BASE_ADDRS_NS                     { AHBSC4_BASE_NS, AHBSC4_ALIAS1_BASE_NS, AHBSC4_ALIAS2_BASE_NS, AHBSC4_ALIAS3_BASE_NS }
  /** Array initializer of AHBSC4 peripheral base pointers */
  #define AHBSC4_BASE_PTRS_NS                      { AHBSC4_NS, AHBSC4_ALIAS1_NS, AHBSC4_ALIAS2_NS, AHBSC4_ALIAS3_NS }
#else
  /** Peripheral AHBSC4 base address */
  #define AHBSC4_BASE                              (0x40400000u)
  /** Peripheral AHBSC4 base pointer */
  #define AHBSC4                                   ((AHBSC4_Type *)AHBSC4_BASE)
  /** Peripheral AHBSC4_ALIAS1 base address */
  #define AHBSC4_ALIAS1_BASE                       (0x40401000u)
  /** Peripheral AHBSC4_ALIAS1 base pointer */
  #define AHBSC4_ALIAS1                            ((AHBSC4_Type *)AHBSC4_ALIAS1_BASE)
  /** Peripheral AHBSC4_ALIAS2 base address */
  #define AHBSC4_ALIAS2_BASE                       (0x40402000u)
  /** Peripheral AHBSC4_ALIAS2 base pointer */
  #define AHBSC4_ALIAS2                            ((AHBSC4_Type *)AHBSC4_ALIAS2_BASE)
  /** Peripheral AHBSC4_ALIAS3 base address */
  #define AHBSC4_ALIAS3_BASE                       (0x40403000u)
  /** Peripheral AHBSC4_ALIAS3 base pointer */
  #define AHBSC4_ALIAS3                            ((AHBSC4_Type *)AHBSC4_ALIAS3_BASE)
  /** Array initializer of AHBSC4 peripheral base addresses */
  #define AHBSC4_BASE_ADDRS                        { AHBSC4_BASE, AHBSC4_ALIAS1_BASE, AHBSC4_ALIAS2_BASE, AHBSC4_ALIAS3_BASE }
  /** Array initializer of AHBSC4 peripheral base pointers */
  #define AHBSC4_BASE_PTRS                         { AHBSC4, AHBSC4_ALIAS1, AHBSC4_ALIAS2, AHBSC4_ALIAS3 }
#endif

