zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/MIMXRT798S_hifi4_COMMON.h
/* GPIO - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral GPIO0 base address */
  #define GPIO0_BASE                               (0x50100000u)
  /** Peripheral GPIO0 base address */
  #define GPIO0_BASE_NS                            (0x40100000u)
  /** Peripheral GPIO0 base pointer */
  #define GPIO0                                    ((GPIO_Type *)GPIO0_BASE)
  /** Peripheral GPIO0 base pointer */
  #define GPIO0_NS                                 ((GPIO_Type *)GPIO0_BASE_NS)
  /** Peripheral GPIO1 base address */
  #define GPIO1_BASE                               (0x50102000u)
  /** Peripheral GPIO1 base address */
  #define GPIO1_BASE_NS                            (0x40102000u)
  /** Peripheral GPIO1 base pointer */
  #define GPIO1                                    ((GPIO_Type *)GPIO1_BASE)
  /** Peripheral GPIO1 base pointer */
  #define GPIO1_NS                                 ((GPIO_Type *)GPIO1_BASE_NS)
  /** Peripheral GPIO2 base address */
  #define GPIO2_BASE                               (0x50104000u)
  /** Peripheral GPIO2 base address */
  #define GPIO2_BASE_NS                            (0x40104000u)
  /** Peripheral GPIO2 base pointer */
  #define GPIO2                                    ((GPIO_Type *)GPIO2_BASE)
  /** Peripheral GPIO2 base pointer */
  #define GPIO2_NS                                 ((GPIO_Type *)GPIO2_BASE_NS)
  /** Peripheral GPIO3 base address */
  #define GPIO3_BASE                               (0x50106000u)
  /** Peripheral GPIO3 base address */
  #define GPIO3_BASE_NS                            (0x40106000u)
  /** Peripheral GPIO3 base pointer */
  #define GPIO3                                    ((GPIO_Type *)GPIO3_BASE)
  /** Peripheral GPIO3 base pointer */
  #define GPIO3_NS                                 ((GPIO_Type *)GPIO3_BASE_NS)
  /** Peripheral GPIO4 base address */
  #define GPIO4_BASE                               (0x50108000u)
  /** Peripheral GPIO4 base address */
  #define GPIO4_BASE_NS                            (0x40108000u)
  /** Peripheral GPIO4 base pointer */
  #define GPIO4                                    ((GPIO_Type *)GPIO4_BASE)
  /** Peripheral GPIO4 base pointer */
  #define GPIO4_NS                                 ((GPIO_Type *)GPIO4_BASE_NS)
  /** Peripheral GPIO5 base address */
  #define GPIO5_BASE                               (0x5010A000u)
  /** Peripheral GPIO5 base address */
  #define GPIO5_BASE_NS                            (0x4010A000u)
  /** Peripheral GPIO5 base pointer */
  #define GPIO5                                    ((GPIO_Type *)GPIO5_BASE)
  /** Peripheral GPIO5 base pointer */
  #define GPIO5_NS                                 ((GPIO_Type *)GPIO5_BASE_NS)
  /** Peripheral GPIO6 base address */
  #define GPIO6_BASE                               (0x5010C000u)
  /** Peripheral GPIO6 base address */
  #define GPIO6_BASE_NS                            (0x4010C000u)
  /** Peripheral GPIO6 base pointer */
  #define GPIO6                                    ((GPIO_Type *)GPIO6_BASE)
  /** Peripheral GPIO6 base pointer */
  #define GPIO6_NS                                 ((GPIO_Type *)GPIO6_BASE_NS)
  /** Peripheral GPIO7 base address */
  #define GPIO7_BASE                               (0x5010E000u)
  /** Peripheral GPIO7 base address */
  #define GPIO7_BASE_NS                            (0x4010E000u)
  /** Peripheral GPIO7 base pointer */
  #define GPIO7                                    ((GPIO_Type *)GPIO7_BASE)
  /** Peripheral GPIO7 base pointer */
  #define GPIO7_NS                                 ((GPIO_Type *)GPIO7_BASE_NS)
  /** Peripheral GPIO0_ALIAS base address */
  #define GPIO0_ALIAS_BASE                         (0x50101000u)
  /** Peripheral GPIO0_ALIAS base address */
  #define GPIO0_ALIAS_BASE_NS                      (0x40101000u)
  /** Peripheral GPIO0_ALIAS base pointer */
  #define GPIO0_ALIAS                              ((GPIO_Type *)GPIO0_ALIAS_BASE)
  /** Peripheral GPIO0_ALIAS base pointer */
  #define GPIO0_ALIAS_NS                           ((GPIO_Type *)GPIO0_ALIAS_BASE_NS)
  /** Peripheral GPIO1_ALIAS base address */
  #define GPIO1_ALIAS_BASE                         (0x50103000u)
  /** Peripheral GPIO1_ALIAS base address */
  #define GPIO1_ALIAS_BASE_NS                      (0x40103000u)
  /** Peripheral GPIO1_ALIAS base pointer */
  #define GPIO1_ALIAS                              ((GPIO_Type *)GPIO1_ALIAS_BASE)
  /** Peripheral GPIO1_ALIAS base pointer */
  #define GPIO1_ALIAS_NS                           ((GPIO_Type *)GPIO1_ALIAS_BASE_NS)
  /** Peripheral GPIO2_ALIAS base address */
  #define GPIO2_ALIAS_BASE                         (0x50105000u)
  /** Peripheral GPIO2_ALIAS base address */
  #define GPIO2_ALIAS_BASE_NS                      (0x40105000u)
  /** Peripheral GPIO2_ALIAS base pointer */
  #define GPIO2_ALIAS                              ((GPIO_Type *)GPIO2_ALIAS_BASE)
  /** Peripheral GPIO2_ALIAS base pointer */
  #define GPIO2_ALIAS_NS                           ((GPIO_Type *)GPIO2_ALIAS_BASE_NS)
  /** Peripheral GPIO3_ALIAS base address */
  #define GPIO3_ALIAS_BASE                         (0x50107000u)
  /** Peripheral GPIO3_ALIAS base address */
  #define GPIO3_ALIAS_BASE_NS                      (0x40107000u)
  /** Peripheral GPIO3_ALIAS base pointer */
  #define GPIO3_ALIAS                              ((GPIO_Type *)GPIO3_ALIAS_BASE)
  /** Peripheral GPIO3_ALIAS base pointer */
  #define GPIO3_ALIAS_NS                           ((GPIO_Type *)GPIO3_ALIAS_BASE_NS)
  /** Peripheral GPIO4_ALIAS base address */
  #define GPIO4_ALIAS_BASE                         (0x50109000u)
  /** Peripheral GPIO4_ALIAS base address */
  #define GPIO4_ALIAS_BASE_NS                      (0x40109000u)
  /** Peripheral GPIO4_ALIAS base pointer */
  #define GPIO4_ALIAS                              ((GPIO_Type *)GPIO4_ALIAS_BASE)
  /** Peripheral GPIO4_ALIAS base pointer */
  #define GPIO4_ALIAS_NS                           ((GPIO_Type *)GPIO4_ALIAS_BASE_NS)
  /** Peripheral GPIO5_ALIAS base address */
  #define GPIO5_ALIAS_BASE                         (0x5010B000u)
  /** Peripheral GPIO5_ALIAS base address */
  #define GPIO5_ALIAS_BASE_NS                      (0x4010B000u)
  /** Peripheral GPIO5_ALIAS base pointer */
  #define GPIO5_ALIAS                              ((GPIO_Type *)GPIO5_ALIAS_BASE)
  /** Peripheral GPIO5_ALIAS base pointer */
  #define GPIO5_ALIAS_NS                           ((GPIO_Type *)GPIO5_ALIAS_BASE_NS)
  /** Peripheral GPIO6_ALIAS base address */
  #define GPIO6_ALIAS_BASE                         (0x5010D000u)
  /** Peripheral GPIO6_ALIAS base address */
  #define GPIO6_ALIAS_BASE_NS                      (0x4010D000u)
  /** Peripheral GPIO6_ALIAS base pointer */
  #define GPIO6_ALIAS                              ((GPIO_Type *)GPIO6_ALIAS_BASE)
  /** Peripheral GPIO6_ALIAS base pointer */
  #define GPIO6_ALIAS_NS                           ((GPIO_Type *)GPIO6_ALIAS_BASE_NS)
  /** Peripheral GPIO7_ALIAS base address */
  #define GPIO7_ALIAS_BASE                         (0x5010F000u)
  /** Peripheral GPIO7_ALIAS base address */
  #define GPIO7_ALIAS_BASE_NS                      (0x4010F000u)
  /** Peripheral GPIO7_ALIAS base pointer */
  #define GPIO7_ALIAS                              ((GPIO_Type *)GPIO7_ALIAS_BASE)
  /** Peripheral GPIO7_ALIAS base pointer */
  #define GPIO7_ALIAS_NS                           ((GPIO_Type *)GPIO7_ALIAS_BASE_NS)
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS                          { GPIO0_BASE, GPIO1_BASE, GPIO2_BASE, GPIO3_BASE, GPIO4_BASE, GPIO5_BASE, GPIO6_BASE, GPIO7_BASE, 0u, 0u, 0u, GPIO0_ALIAS_BASE, GPIO1_ALIAS_BASE, GPIO2_ALIAS_BASE, GPIO3_ALIAS_BASE, GPIO4_ALIAS_BASE, GPIO5_ALIAS_BASE, GPIO6_ALIAS_BASE, GPIO7_ALIAS_BASE }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS                           { GPIO0, GPIO1, GPIO2, GPIO3, GPIO4, GPIO5, GPIO6, GPIO7, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, GPIO0_ALIAS, GPIO1_ALIAS, GPIO2_ALIAS, GPIO3_ALIAS, GPIO4_ALIAS, GPIO5_ALIAS, GPIO6_ALIAS, GPIO7_ALIAS }
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS_NS                       { GPIO0_BASE_NS, GPIO1_BASE_NS, GPIO2_BASE_NS, GPIO3_BASE_NS, GPIO4_BASE_NS, GPIO5_BASE_NS, GPIO6_BASE_NS, GPIO7_BASE_NS, 0u, 0u, 0u, GPIO0_ALIAS_BASE_NS, GPIO1_ALIAS_BASE_NS, GPIO2_ALIAS_BASE_NS, GPIO3_ALIAS_BASE_NS, GPIO4_ALIAS_BASE_NS, GPIO5_ALIAS_BASE_NS, GPIO6_ALIAS_BASE_NS, GPIO7_ALIAS_BASE_NS }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS_NS                        { GPIO0_NS, GPIO1_NS, GPIO2_NS, GPIO3_NS, GPIO4_NS, GPIO5_NS, GPIO6_NS, GPIO7_NS, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, GPIO0_ALIAS_NS, GPIO1_ALIAS_NS, GPIO2_ALIAS_NS, GPIO3_ALIAS_NS, GPIO4_ALIAS_NS, GPIO5_ALIAS_NS, GPIO6_ALIAS_NS, GPIO7_ALIAS_NS }
#else
  /** Peripheral GPIO0 base address */
  #define GPIO0_BASE                               (0x40100000u)
  /** Peripheral GPIO0 base pointer */
  #define GPIO0                                    ((GPIO_Type *)GPIO0_BASE)
  /** Peripheral GPIO1 base address */
  #define GPIO1_BASE                               (0x40102000u)
  /** Peripheral GPIO1 base pointer */
  #define GPIO1                                    ((GPIO_Type *)GPIO1_BASE)
  /** Peripheral GPIO2 base address */
  #define GPIO2_BASE                               (0x40104000u)
  /** Peripheral GPIO2 base pointer */
  #define GPIO2                                    ((GPIO_Type *)GPIO2_BASE)
  /** Peripheral GPIO3 base address */
  #define GPIO3_BASE                               (0x40106000u)
  /** Peripheral GPIO3 base pointer */
  #define GPIO3                                    ((GPIO_Type *)GPIO3_BASE)
  /** Peripheral GPIO4 base address */
  #define GPIO4_BASE                               (0x40108000u)
  /** Peripheral GPIO4 base pointer */
  #define GPIO4                                    ((GPIO_Type *)GPIO4_BASE)
  /** Peripheral GPIO5 base address */
  #define GPIO5_BASE                               (0x4010A000u)
  /** Peripheral GPIO5 base pointer */
  #define GPIO5                                    ((GPIO_Type *)GPIO5_BASE)
  /** Peripheral GPIO6 base address */
  #define GPIO6_BASE                               (0x4010C000u)
  /** Peripheral GPIO6 base pointer */
  #define GPIO6                                    ((GPIO_Type *)GPIO6_BASE)
  /** Peripheral GPIO7 base address */
  #define GPIO7_BASE                               (0x4010E000u)
  /** Peripheral GPIO7 base pointer */
  #define GPIO7                                    ((GPIO_Type *)GPIO7_BASE)
  /** Peripheral GPIO0_ALIAS base address */
  #define GPIO0_ALIAS_BASE                         (0x40101000u)
  /** Peripheral GPIO0_ALIAS base pointer */
  #define GPIO0_ALIAS                              ((GPIO_Type *)GPIO0_ALIAS_BASE)
  /** Peripheral GPIO1_ALIAS base address */
  #define GPIO1_ALIAS_BASE                         (0x40103000u)
  /** Peripheral GPIO1_ALIAS base pointer */
  #define GPIO1_ALIAS                              ((GPIO_Type *)GPIO1_ALIAS_BASE)
  /** Peripheral GPIO2_ALIAS base address */
  #define GPIO2_ALIAS_BASE                         (0x40105000u)
  /** Peripheral GPIO2_ALIAS base pointer */
  #define GPIO2_ALIAS                              ((GPIO_Type *)GPIO2_ALIAS_BASE)
  /** Peripheral GPIO3_ALIAS base address */
  #define GPIO3_ALIAS_BASE                         (0x40107000u)
  /** Peripheral GPIO3_ALIAS base pointer */
  #define GPIO3_ALIAS                              ((GPIO_Type *)GPIO3_ALIAS_BASE)
  /** Peripheral GPIO4_ALIAS base address */
  #define GPIO4_ALIAS_BASE                         (0x40109000u)
  /** Peripheral GPIO4_ALIAS base pointer */
  #define GPIO4_ALIAS                              ((GPIO_Type *)GPIO4_ALIAS_BASE)
  /** Peripheral GPIO5_ALIAS base address */
  #define GPIO5_ALIAS_BASE                         (0x4010B000u)
  /** Peripheral GPIO5_ALIAS base pointer */
  #define GPIO5_ALIAS                              ((GPIO_Type *)GPIO5_ALIAS_BASE)
  /** Peripheral GPIO6_ALIAS base address */
  #define GPIO6_ALIAS_BASE                         (0x4010D000u)
  /** Peripheral GPIO6_ALIAS base pointer */
  #define GPIO6_ALIAS                              ((GPIO_Type *)GPIO6_ALIAS_BASE)
  /** Peripheral GPIO7_ALIAS base address */
  #define GPIO7_ALIAS_BASE                         (0x4010F000u)
  /** Peripheral GPIO7_ALIAS base pointer */
  #define GPIO7_ALIAS                              ((GPIO_Type *)GPIO7_ALIAS_BASE)
  /** Array initializer of GPIO peripheral base addresses */
  #define GPIO_BASE_ADDRS                          { GPIO0_BASE, GPIO1_BASE, GPIO2_BASE, GPIO3_BASE, GPIO4_BASE, GPIO5_BASE, GPIO6_BASE, GPIO7_BASE, 0u, 0u, 0u, GPIO0_ALIAS_BASE, GPIO1_ALIAS_BASE, GPIO2_ALIAS_BASE, GPIO3_ALIAS_BASE, GPIO4_ALIAS_BASE, GPIO5_ALIAS_BASE, GPIO6_ALIAS_BASE, GPIO7_ALIAS_BASE }
  /** Array initializer of GPIO peripheral base pointers */
  #define GPIO_BASE_PTRS                           { GPIO0, GPIO1, GPIO2, GPIO3, GPIO4, GPIO5, GPIO6, GPIO7, (GPIO_Type *)0u, (GPIO_Type *)0u, (GPIO_Type *)0u, GPIO0_ALIAS, GPIO1_ALIAS, GPIO2_ALIAS, GPIO3_ALIAS, GPIO4_ALIAS, GPIO5_ALIAS, GPIO6_ALIAS, GPIO7_ALIAS }
#endif
/* Interrupt vectors for the GPIO peripheral type */


/* I2S - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral SAI0 base address */
  #define SAI0_BASE                                (0x50152000u)
  /** Peripheral SAI0 base address */
  #define SAI0_BASE_NS                             (0x40152000u)
  /** Peripheral SAI0 base pointer */
  #define SAI0                                     ((I2S_Type *)SAI0_BASE)
  /** Peripheral SAI0 base pointer */
  #define SAI0_NS                                  ((I2S_Type *)SAI0_BASE_NS)
  /** Peripheral SAI1 base address */
  #define SAI1_BASE                                (0x50153000u)
  /** Peripheral SAI1 base address */
  #define SAI1_BASE_NS                             (0x40153000u)
  /** Peripheral SAI1 base pointer */
  #define SAI1                                     ((I2S_Type *)SAI1_BASE)
  /** Peripheral SAI1 base pointer */
  #define SAI1_NS                                  ((I2S_Type *)SAI1_BASE_NS)
  /** Peripheral SAI2 base address */
  #define SAI2_BASE                                (0x50154000u)
  /** Peripheral SAI2 base address */
  #define SAI2_BASE_NS                             (0x40154000u)
  /** Peripheral SAI2 base pointer */
  #define SAI2                                     ((I2S_Type *)SAI2_BASE)
  /** Peripheral SAI2 base pointer */
  #define SAI2_NS                                  ((I2S_Type *)SAI2_BASE_NS)
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS                           { SAI0_BASE, SAI1_BASE, SAI2_BASE }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS                            { SAI0, SAI1, SAI2 }
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS_NS                        { SAI0_BASE_NS, SAI1_BASE_NS, SAI2_BASE_NS }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS_NS                         { SAI0_NS, SAI1_NS, SAI2_NS }
#else
  /** Peripheral SAI0 base address */
  #define SAI0_BASE                                (0x40152000u)
  /** Peripheral SAI0 base pointer */
  #define SAI0                                     ((I2S_Type *)SAI0_BASE)
  /** Peripheral SAI1 base address */
  #define SAI1_BASE                                (0x40153000u)
  /** Peripheral SAI1 base pointer */
  #define SAI1                                     ((I2S_Type *)SAI1_BASE)
  /** Peripheral SAI2 base address */
  #define SAI2_BASE                                (0x40154000u)
  /** Peripheral SAI2 base pointer */
  #define SAI2                                     ((I2S_Type *)SAI2_BASE)
  /** Array initializer of I2S peripheral base addresses */
  #define I2S_BASE_ADDRS                           { SAI0_BASE, SAI1_BASE, SAI2_BASE }
  /** Array initializer of I2S peripheral base pointers */
  #define I2S_BASE_PTRS                            { SAI0, SAI1, SAI2 }
#endif
/** Interrupt vectors for the I2S peripheral type */
#define I2S_RX_IRQS                              { SAI0_TX_RX_IRQn, SAI1_TX_RX_IRQn, SAI2_TX_RX_IRQn }
#define I2S_TX_IRQS                              { SAI0_TX_RX_IRQn, SAI1_TX_RX_IRQn, SAI2_TX_RX_IRQn }

/* I3C - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral I3C0 base address */
  #define I3C0_BASE                                (0x50037000u)
  /** Peripheral I3C0 base address */
  #define I3C0_BASE_NS                             (0x40037000u)
  /** Peripheral I3C0 base pointer */
  #define I3C0                                     ((I3C_Type *)I3C0_BASE)
  /** Peripheral I3C0 base pointer */
  #define I3C0_NS                                  ((I3C_Type *)I3C0_BASE_NS)
  /** Peripheral I3C1 base address */
  #define I3C1_BASE                                (0x50038000u)
  /** Peripheral I3C1 base address */
  #define I3C1_BASE_NS                             (0x40038000u)
  /** Peripheral I3C1 base pointer */
  #define I3C1                                     ((I3C_Type *)I3C1_BASE)
  /** Peripheral I3C1 base pointer */
  #define I3C1_NS                                  ((I3C_Type *)I3C1_BASE_NS)
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS                           { I3C0_BASE, I3C1_BASE }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS                            { I3C0, I3C1 }
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS_NS                        { I3C0_BASE_NS, I3C1_BASE_NS }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS_NS                         { I3C0_NS, I3C1_NS }
#else
  /** Peripheral I3C0 base address */
  #define I3C0_BASE                                (0x40037000u)
  /** Peripheral I3C0 base pointer */
  #define I3C0                                     ((I3C_Type *)I3C0_BASE)
  /** Peripheral I3C1 base address */
  #define I3C1_BASE                                (0x40038000u)
  /** Peripheral I3C1 base pointer */
  #define I3C1                                     ((I3C_Type *)I3C1_BASE)
  /** Array initializer of I3C peripheral base addresses */
  #define I3C_BASE_ADDRS                           { I3C0_BASE, I3C1_BASE }
  /** Array initializer of I3C peripheral base pointers */
  #define I3C_BASE_PTRS                            { I3C0, I3C1 }
#endif
/** Interrupt vectors for the I3C peripheral type */
#define I3C_IRQS                                 { I3C0_IRQn, I3C1_IRQn }

/* INPUTMUX0 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral INPUTMUX0 base address */
  #define INPUTMUX0_BASE                           (0x50026000u)
  /** Peripheral INPUTMUX0 base address */
  #define INPUTMUX0_BASE_NS                        (0x40026000u)
  /** Peripheral INPUTMUX0 base pointer */
  #define INPUTMUX0                                ((INPUTMUX0_Type *)INPUTMUX0_BASE)
  /** Peripheral INPUTMUX0 base pointer */
  #define INPUTMUX0_NS                             ((INPUTMUX0_Type *)INPUTMUX0_BASE_NS)
  /** Array initializer of INPUTMUX0 peripheral base addresses */
  #define INPUTMUX0_BASE_ADDRS                     { INPUTMUX0_BASE }
  /** Array initializer of INPUTMUX0 peripheral base pointers */
  #define INPUTMUX0_BASE_PTRS                      { INPUTMUX0 }
  /** Array initializer of INPUTMUX0 peripheral base addresses */
  #define INPUTMUX0_BASE_ADDRS_NS                  { INPUTMUX0_BASE_NS }
  /** Array initializer of INPUTMUX0 peripheral base pointers */
  #define INPUTMUX0_BASE_PTRS_NS                   { INPUTMUX0_NS }
#else
  /** Peripheral INPUTMUX0 base address */
  #define INPUTMUX0_BASE                           (0x40026000u)
  /** Peripheral INPUTMUX0 base pointer */
  #define INPUTMUX0                                ((INPUTMUX0_Type *)INPUTMUX0_BASE)
  /** Array initializer of INPUTMUX0 peripheral base addresses */
  #define INPUTMUX0_BASE_ADDRS                     { INPUTMUX0_BASE }
  /** Array initializer of INPUTMUX0 peripheral base pointers */
  #define INPUTMUX0_BASE_PTRS                      { INPUTMUX0 }
#endif
/** INPUTMUX extra definition */
#define INPUTMUX_Type INPUTMUX0_Type
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
#define INPUTMUX_BASE_ADDRS INPUTMUX0_BASE_ADDRS
#define INPUTMUX_BASE_PTRS INPUTMUX0_BASE_PTRS
#define INPUTMUX_BASE_ADDRS_NS INPUTMUX0_BASE_ADDRS_NS
#define INPUTMUX_BASE_PTRS_NS INPUTMUX0_BASE_PTRS_NS
#else
#define INPUTMUX_BASE_ADDRS INPUTMUX0_BASE_ADDRS
#define INPUTMUX_BASE_PTRS INPUTMUX0_BASE_PTRS
#endif


/* IOPCTL0 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral IOPCTL0 base address */
  #define IOPCTL0_BASE                             (0x50004000u)
  /** Peripheral IOPCTL0 base address */
  #define IOPCTL0_BASE_NS                          (0x40004000u)
  /** Peripheral IOPCTL0 base pointer */
  #define IOPCTL0                                  ((IOPCTL0_Type *)IOPCTL0_BASE)
  /** Peripheral IOPCTL0 base pointer */
  #define IOPCTL0_NS                               ((IOPCTL0_Type *)IOPCTL0_BASE_NS)
  /** Array initializer of IOPCTL0 peripheral base addresses */
  #define IOPCTL0_BASE_ADDRS                       { IOPCTL0_BASE }
  /** Array initializer of IOPCTL0 peripheral base pointers */
  #define IOPCTL0_BASE_PTRS                        { IOPCTL0 }
  /** Array initializer of IOPCTL0 peripheral base addresses */
  #define IOPCTL0_BASE_ADDRS_NS                    { IOPCTL0_BASE_NS }
  /** Array initializer of IOPCTL0 peripheral base pointers */
  #define IOPCTL0_BASE_PTRS_NS                     { IOPCTL0_NS }
#else
  /** Peripheral IOPCTL0 base address */
  #define IOPCTL0_BASE                             (0x40004000u)
  /** Peripheral IOPCTL0 base pointer */
  #define IOPCTL0                                  ((IOPCTL0_Type *)IOPCTL0_BASE)
  /** Array initializer of IOPCTL0 peripheral base addresses */
  #define IOPCTL0_BASE_ADDRS                       { IOPCTL0_BASE }
  /** Array initializer of IOPCTL0 peripheral base pointers */
  #define IOPCTL0_BASE_PTRS                        { IOPCTL0 }
#endif

